src/bsl/InformationRegisters/гкс_СоответствияОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СоответствияОбъектовСРПВ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИнтеграцияСРПВСправочники</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаСРПВ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыОбъектовСРПВ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСРПВ</Name>
					<Comment>Идентификатор объекта СРПВ</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.гкс_ИдентификаторыСРПВ</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_ТипыОбъектовСРПВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_ТипыОбъектовСРПВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПЛК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Весы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтруктураПЛК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СоответствияОбъектовСРПВ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает ссылку на ПЛК (точку маршрута) по идентификатору СРПВ
//
// Параметры:
//  Идентификатор - строка - идентификатор ПЛК в СРПВ
//
// Возвращаемое значение:
//  СправочникСсылка.гкс_ТочкиМаршрута - ссылка на точку маршрута
//
Функция ТочкаМаршрутаПоИдентификаторуСРПВ(Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияОбъектовСРПВ.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК СоответствияОбъектовСРПВ
	|ГДЕ
	|	СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.ПЛК)
	|	И СоответствияОбъектовСРПВ.ИдентификаторСРПВ = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.гкс_ТочкиМаршрута.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает ссылку на путь (структура ПЛК) по идентификатору СРПВ
//
// Параметры:
//  Идентификатор - число - идентификатор пути в СРПВ
//
// Возвращаемое значение:
//  СправочникСсылка.гкс_СтруктураПЛК - ссылка на точку маршрута
//
Функция ПутьПоИдентификаторуСРПВ(Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияОбъектовСРПВ.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК СоответствияОбъектовСРПВ
	|ГДЕ
	|	СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.СтруктураПЛК)
	|	И СоответствияОбъектовСРПВ.ИдентификаторСРПВ = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.гкс_СтруктураПЛК.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает ссылку на весы (оборудование на ПЛК) по идентификатору СРПВ
//
// Параметры:
//  Идентификатор - строка - идентификатор ПЛК в СРПВ
//
// Возвращаемое значение:
//  СправочникСсылка.гкс_ОборудованиеПЛК - ссылка на весы
//
Функция ВесыПоИдентификаторуСРПВ(Идентификатор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияОбъектовСРПВ.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК СоответствияОбъектовСРПВ
	|ГДЕ
	|	СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыОбъектовСРПВ.Весы)
	|	И СоответствияОбъектовСРПВ.ИдентификаторСРПВ = &Идентификатор";

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.гкс_ОборудованиеПЛК.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Идентификатор объекта СРПВ.
//
// Параметры:
//  Объект - ОпределяемыйТип.гкс_ИнтеграцияСРПВСправочники - Ссылка на объект
//  ТипОбъекта - ПеречислениеСсылка.гкс_ТипыОбъектовСРПВ - Тип объекта
//
// Возвращаемое значение:
//  Неопределено - Идентификатор объекта СРПВ
Функция ИдентификаторОбъектаСРПВ(Объект, ТипОбъекта) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствияОбъектовСРПВ.ИдентификаторСРПВ КАК ИдентификаторСРПВ
	|ИЗ
	|	РегистрСведений.гкс_СоответствияОбъектовСРПВ КАК СоответствияОбъектовСРПВ
	|ГДЕ
	|	СоответствияОбъектовСРПВ.ТипОбъектаСРПВ = &ТипОбъекта
	|	И СоответствияОбъектовСРПВ.Ссылка = &Объект";

	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    Результат = Выборка.ИдентификаторСРПВ;
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоИдентификаторТекущегоПЛК(Идентификатор) Экспорт

	ТочкаМаршрутаПЛК = ТочкаМаршрутаПоИдентификаторуСРПВ(Идентификатор);

	Если ЗначениеЗаполнено(ТочкаМаршрутаПЛК)
		И ТочкаМаршрутаПЛК = Константы.гкс_ТочкаМаршрутаБазы.Получить() Тогда

		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

#КонецОбласти

#КонецЕсли
